"""Даны числа a, b, c, d, e, f. Решите систему линейных уравнений

Формат ввода
Вводятся 6 вещественных чисел - коэффициенты уравнений.

Формат вывода
Вывод программы зависит от вида решения этой системы. Если система не 
имеет решений, то программа должна вывести единственное число 0. Если 
система имеет бесконечно много решений, каждое из которых имеет вид 
y=kx+b, то программа должна вывести число 1, а затем значения k и b. Если 
система имеет единственное решение (x0,y0), то программа должна вывести число 
2, а затем значения x0 и y0. Если система имеет бесконечно много решений вида 
x=x0, y — любое, то программа должна вывести число 3, а затем значение x0. 
Если система имеет бесконечно много решений вида y=y0, x — любое, то программа 
должна вывести число 4, а затем значение y0. Если любая пара чисел (x,y) 
является решением, то программа должна вывести число 5.

Числа x0 и y0 будут проверяться с точностью до пяти знаков после точки."""

import numpy as np


a, b, c, d, e, f = (int(input()) for _ in range(6))
A = np.array([[a, b], [c, d]], float)
B = np.array([f, e], float)
AB = np.c_[A, B]
rank_A = np.linalg.matrix_rank(A)
rank_AB = np.linalg.matrix_rank(AB)
print(rank_A, rank_AB)
# if rank_A == rank_AB:
#     # СЛАУ совместна
#     if rank_A == 2:
#         # имеет единственное решение
#         x = np.linalg.solve(A, B)
#         print(2, x[0], x[1])
#     else:
#         # имеет бесконечно много решений
#         pass   
# else:
#     print(0)