"""
Последовательность чисел назовем симметричной, если она одинаково 
читается как слева направо, так и справа налево. Например, следующие 
последовательности являются симметричными:

1 2 3 4 5 4 3 2 1

1 2 1 2 2 1 2 1

Вашей программе будет дана последовательность чисел. Требуется определить, 
какое минимальное количество и каких чисел надо приписать в конец этой  
последовательности, чтобы она стала симметричной.

Формат ввода
Сначала вводится число N — количество элементов исходной последовательности 
(1 ≤ N ≤ 100). Далее идут N чисел — элементы этой последовательности, 
атуральные числа от 1 до 9.

Формат вывода
Выведите сначала число M — минимальное количество элементов, которое надо 
дописать к последовательности, а потом M чисел (каждое — от 1 до 9) — 
числа, которые надо дописать к последовательности.
"""
def make_symmetric(seq):
    """Determine the minimum numbers to append to make the sequence symmetric."""
    for start in range(len(seq)):
        i = start
        j = len(seq) - 1
        while i < len(seq) and seq[i] == seq[j]:
            i += 1
            j -= 1
            if i > j:
                print(start)
                if start:
                    print(' '.join(str(x) for x in seq[start - 1::-1]))
                return

make_symmetric(seq)